load_test_results/20251115_235647_get_team.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /team/get?team_name=team_1
Document Length:        1297 bytes

Concurrency Level:      10
Time taken for tests:   0.677 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      1407000 bytes
HTML transferred:       1297000 bytes
Requests per second:    1477.05 [#/sec] (mean)
Time per request:       6.770 [ms] (mean)
Time per request:       0.677 [ms] (mean, across all concurrent requests)
Transfer rate:          2029.50 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     1    6   4.3      5      48
Waiting:        1    6   4.3      5      48
Total:          1    7   4.3      6      48

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      7
  75%      8
  80%      8
  90%     11
  95%     13
  98%     16
  99%     27
 100%     48 (longest request)