load_test_results/20251115_235647_statistics.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /statistics
Document Length:        14479 bytes

Concurrency Level:      10
Time taken for tests:   1.202 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      14567000 bytes
HTML transferred:       14479000 bytes
Requests per second:    831.87 [#/sec] (mean)
Time per request:       12.021 [ms] (mean)
Time per request:       1.202 [ms] (mean, across all concurrent requests)
Transfer rate:          11833.89 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     4   12   9.3     10     221
Waiting:        4   10   6.0      9      79
Total:          4   12   9.3     10     221

Percentage of the requests served within a certain time (ms)
  50%     10
  66%     12
  75%     13
  80%     14
  90%     17
  95%     21
  98%     30
  99%     50
 100%    221 (longest request)